ckormanyos/real-time-cpp/ref_app/src/mcal/xtensa32/from_sdk/esp32-hal-gpio.cpp
///////////////////////////////////////////////////////////////////////////////
//  Copyright Christopher Kormanyos 2020 - 2025.
//  Distributed under the Boost Software License,
//  Version 1.0. (See accompanying file LICENSE_1_0.txt
//  or copy at http://www.boost.org/LICENSE_1_0.txt)
//

///////////////////////////////////////////////////////////////////////////////
// Original copyright:
//

// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <from_sdk/esp32-hal-gpio.h>
#include <from_sdk/soc/gpio_struct.h>

#define digitalPinIsValid(pin)       ((pin) < 40 && esp32_gpioMux[(pin)].reg)
#define BIT(nr)                      (1UL << (nr))
#define ESP_REG(addr)                *((volatile uint32_t *)(addr))
#define GPIO_PIN_COUNT               40
#define GPIO_PIN0_PAD_DRIVER_S       2
#define DR_REG_RTCIO_BASE            0x3FF48400
#define DR_REG_IO_MUX_BASE           0x3FF49000
#define RTC_GPIO_ENABLE_W1TC_REG     (DR_REG_RTCIO_BASE + 0x14)
#define RTC_GPIO_ENABLE_W1TC_S       14
#define RTC_IO_TOUCH_PAD1_FUN_SEL_V  0x3

/* The following are the bit fields for PERIPHS_IO_MUX_x_U registers */
/* Output enable in sleep mode */
#define SLP_OE (BIT(0))
#define SLP_OE_M (BIT(0))
#define SLP_OE_V 1
#define SLP_OE_S 0
/* Pin used for wakeup from sleep */
#define SLP_SEL (BIT(1))
#define SLP_SEL_M (BIT(1))
#define SLP_SEL_V 1
#define SLP_SEL_S 1
/* Pulldown enable in sleep mode */
#define SLP_PD (BIT(2))
#define SLP_PD_M (BIT(2))
#define SLP_PD_V 1
#define SLP_PD_S 2
/* Pullup enable in sleep mode */
#define SLP_PU (BIT(3))
#define SLP_PU_M (BIT(3))
#define SLP_PU_V 1
#define SLP_PU_S 3
/* Input enable in sleep mode */
#define SLP_IE (BIT(4))
#define SLP_IE_M (BIT(4))
#define SLP_IE_V 1
#define SLP_IE_S 4
/* Drive strength in sleep mode */
#define SLP_DRV 0x3
#define SLP_DRV_M (SLP_DRV_V << SLP_DRV_S)
#define SLP_DRV_V 0x3
#define SLP_DRV_S 5
/* Pulldown enable */
#define FUN_PD (BIT(7))
#define FUN_PD_M (BIT(7))
#define FUN_PD_V 1
#define FUN_PD_S 7
/* Pullup enable */
#define FUN_PU (BIT(8))
#define FUN_PU_M (BIT(8))
#define FUN_PU_V 1
#define FUN_PU_S 8
/* Input enable */
#define FUN_IE (BIT(9))
#define FUN_IE_M (FUN_IE_V << FUN_IE_S)
#define FUN_IE_V 1
#define FUN_IE_S 9
/* Drive strength */
#define FUN_DRV 0x3
#define FUN_DRV_M (FUN_DRV_V << FUN_DRV_S)
#define FUN_DRV_V 0x3
#define FUN_DRV_S 10
/* Function select (possible values are defined for each pin as FUNC_pinname_function below) */
#define MCU_SEL 0x7
#define MCU_SEL_M (MCU_SEL_V << MCU_SEL_S)
#define MCU_SEL_V 0x7
#define MCU_SEL_S 12

typedef struct esp32_gpioMux_t
{
  uint8_t reg;      /*!< GPIO register offset from DR_REG_IO_MUX_BASE */
   int8_t rtc;      /*!< RTC GPIO number (-1 if not RTC GPIO pin) */
   int8_t adc;      /*!< ADC Channel number (-1 if not ADC pin) */
   int8_t touch;    /*!< Touch Channel number (-1 if not Touch pin) */
}
esp32_gpioMux_t;

typedef struct rtc_gpio_desc_t
{
  uint32_t reg;       /*!< Register of RTC pad, or 0 if not an RTC GPIO */
  uint32_t mux;       /*!< Bit mask for selecting digital pad or RTC pad */
  uint32_t func;      /*!< Shift of pad function (FUN_SEL) field */
  uint32_t ie;        /*!< Mask of input enable */
  uint32_t pullup;    /*!< Mask of pullup enable */
  uint32_t pulldown;  /*!< Mask of pulldown enable */
  uint32_t slpsel;    /*!< If slpsel bit is set, slpie will be used as pad input enabled signal in sleep mode */
  uint32_t slpie;     /*!< Mask of input enable in sleep mode */
  uint32_t hold;      /*!< Mask of hold enable */
  uint32_t hold_force;/*!< Mask of hold_force bit for RTC IO in RTC_CNTL_HOLD_FORCE_REG */
  uint32_t drv_v;     /*!< Mask of drive capability */
  uint32_t drv_s;     /*!< Offset of drive capability */
  int rtc_num;        /*!< RTC IO number, or -1 if not an RTC GPIO */
}
rtc_gpio_desc_t;

extern const rtc_gpio_desc_t rtc_gpio_desc[GPIO_PIN_COUNT];

static const int8_t esp32_adc2gpio[20] =
{
  36, 37, 38, 39, 32, 33, 34, 35, -1, -1, 4, 0, 2, 15, 13, 12, 14, 27, 25, 26
};

static const esp32_gpioMux_t esp32_gpioMux[GPIO_PIN_COUNT] =
{
  {0x44, 11, 11, 1},
  {0x88, -1, -1, -1},
  {0x40, 12, 12, 2},
  {0x84, -1, -1, -1},
  {0x48, 10, 10, 0},
  {0x6c, -1, -1, -1},
  {0x60, -1, -1, -1},
  {0x64, -1, -1, -1},
  {0x68, -1, -1, -1},
  {0x54, -1, -1, -1},
  {0x58, -1, -1, -1},
  {0x5c, -1, -1, -1},
  {0x34, 15, 15, 5},
  {0x38, 14, 14, 4},
  {0x30, 16, 16, 6},
  {0x3c, 13, 13, 3},
  {0x4c, -1, -1, -1},
  {0x50, -1, -1, -1},
  {0x70, -1, -1, -1},
  {0x74, -1, -1, -1},
  {0x78, -1, -1, -1},
  {0x7c, -1, -1, -1},
  {0x80, -1, -1, -1},
  {0x8c, -1, -1, -1},
  {0, -1, -1, -1},
  {0x24, 6, 18, -1}, //DAC1
  {0x28, 7, 19, -1}, //DAC2
  {0x2c, 17, 17, 7},
  {0, -1, -1, -1},
  {0, -1, -1, -1},
  {0, -1, -1, -1},
  {0, -1, -1, -1},
  {0x1c, 9, 4, 8},
  {0x20, 8, 5, 9},
  {0x14, 4, 6, -1},
  {0x18, 5, 7, -1},
  {0x04, 0, 0, -1},
  {0x08, 1, 1, -1},
  {0x0c, 2, 2, -1},
  {0x10, 3, 3, -1}
};

extern "C"
void pinMode(const uint8_t pin, const uint8_t mode)
{
  if(!digitalPinIsValid(pin))
  {
    return;
  }

  const uint32_t rtc_reg = rtc_gpio_desc[pin].reg;

  if(mode == ANALOG)
  {
    if(!rtc_reg)
    {
      // Not rtc pin.
      return;
    }

    // Lock rtc.
    uint32_t reg_val = ESP_REG(rtc_reg);

    if(reg_val & rtc_gpio_desc[pin].mux)
    {
      // Already in adc mode.
      return;
    }

    reg_val &= ~(  (RTC_IO_TOUCH_PAD1_FUN_SEL_V << rtc_gpio_desc[pin].func)
                 | rtc_gpio_desc[pin].ie
                 | rtc_gpio_desc[pin].pullup
                 | rtc_gpio_desc[pin].pulldown);

    ESP_REG(RTC_GPIO_ENABLE_W1TC_REG) = (1 << (rtc_gpio_desc[pin].rtc_num + RTC_GPIO_ENABLE_W1TC_S));
    ESP_REG(rtc_reg) = reg_val | rtc_gpio_desc[pin].mux;

    //unlock rtc
    ESP_REG(DR_REG_IO_MUX_BASE + esp32_gpioMux[pin].reg) = ((uint32_t)2 << MCU_SEL_S) | ((uint32_t)2 << FUN_DRV_S) | FUN_IE;

    return;
  }

  //RTC pins PULL settings
  if(rtc_reg)
  {
    //lock rtc
    ESP_REG(rtc_reg) = ESP_REG(rtc_reg) & ~(rtc_gpio_desc[pin].mux);

    if(mode & PULLUP)
    {
      ESP_REG(rtc_reg) = (ESP_REG(rtc_reg) | rtc_gpio_desc[pin].pullup) & ~(rtc_gpio_desc[pin].pulldown);
    }
    else if(mode & PULLDOWN)
    {
      ESP_REG(rtc_reg) = (ESP_REG(rtc_reg) | rtc_gpio_desc[pin].pulldown) & ~(rtc_gpio_desc[pin].pullup);
    }
    else
    {
      ESP_REG(rtc_reg) = ESP_REG(rtc_reg) & ~(rtc_gpio_desc[pin].pullup | rtc_gpio_desc[pin].pulldown);
    }
    //unlock rtc
  }

  uint32_t pinFunction = 0;
  uint32_t pinControl  = 0;

  //lock gpio
  if(mode & INPUT)
  {
    if(pin < 32)
    {
      GPIO.enable_w1tc = ((uint32_t)1 << pin);
    }
    else
    {
      GPIO.enable1_w1tc.val = ((uint32_t)1 << (pin - 32));
    }
  }
  else if(mode & OUTPUT)
  {
    // Pins above 33 can be only inputs.
    if(pin > 33)
    {
      // Unlock gpio.
      return;
    }
    else if(pin < 32)
    {
      GPIO.enable_w1ts = ((uint32_t)1 << pin);
    }
    else
    {
      GPIO.enable1_w1ts.val = ((uint32_t)1 << (pin - 32));
    }
  }

  if(mode & PULLUP)
  {
    pinFunction |= FUN_PU;
  }
  else if(mode & PULLDOWN)
  {
    pinFunction |= FUN_PD;
  }

  pinFunction |= ((uint32_t)2 << FUN_DRV_S);//what are the drivers?
  pinFunction |= FUN_IE;//input enable but required for output as well?

  if(mode & (INPUT | OUTPUT))
  {
    pinFunction |= ((uint32_t)2 << MCU_SEL_S);
  }
  else if(mode == SPECIAL)
  {
    pinFunction |= ((uint32_t)(((pin)==1||(pin)==3)?0:1) << MCU_SEL_S);
  }
  else
  {
    pinFunction |= ((uint32_t)(mode >> 5) << MCU_SEL_S);
  }

  ESP_REG(DR_REG_IO_MUX_BASE + esp32_gpioMux[pin].reg) = pinFunction;

  if(mode & OPEN_DRAIN)
  {
    pinControl = (1 << GPIO_PIN0_PAD_DRIVER_S);
  }

  GPIO.pin[pin].val = pinControl;
  //unlock gpio
}

extern "C"
void digitalWrite(const uint8_t pin, const uint8_t val)
{
  if(val)
  {
    if(pin < 32)
    {
      GPIO.out_w1ts = ((uint32_t)1 << pin);
    }
    else if(pin < 34)
    {
      GPIO.out1_w1ts.val = ((uint32_t)1 << (pin - 32));
    }
  }
  else
  {
    if(pin < 32)
    {
      GPIO.out_w1tc = ((uint32_t)1 << pin);
    }
    else if(pin < 34)
    {
      GPIO.out1_w1tc.val = ((uint32_t)1 << (pin - 32));
    }
  }
}

extern "C"
int digitalRead(const uint8_t pin)
{
  int result;

  if(pin < 32)
  {
    result = (GPIO.in >> pin) & 0x1;
  }
  else if(pin < 40)
  {
    result = (GPIO.in1.val >> (pin - 32)) & 0x1;
  }
  else
  {
    result = 0;
  }

  return result;
}
